NSCameraUsageDescription = "จำเป็นต้องเข้าถึงกล้องเพื่อสแกนเอกสาร และถ่ายภาพและวิดีโอ";
NSFaceIDUsageDescription = "ต้องใช้ Face ID เพื่อตรวจสอบสิทธิ์โดยใช้การจดจำใบหน้า";
NSLocationAlwaysUsageDescription = "The app uses your location to automatically trigger file uploads when you move between areas.";
NSPhotoLibraryUsageDescription = "จำเป็นต้องเข้าถึงคลังรูปภาพเพื่ออัปโหลดรูปภาพและวิดีโอไปยังคลาวด์ของคุณ";
NSPhotoLibraryAddUsageDescription = "จำเป็นต้องเข้าถึงคลังรูปภาพเพื่ออัปโหลดรูปภาพและวิดีโอไปยังคลาวด์ของคุณ";
NSMicrophoneUsageDescription = "จำเป็นต้องเข้าถึงไมโครโฟนเพื่อสร้างโน้ตเสียง";
NSLocationWhenInUseUsageDescription = "This app uses your location to detect movement and automatically upload files. It does not use GPS and does not store your location.";
NSLocationAlwaysAndWhenInUseUsageDescription = "This app needs access to your location even in the background to automatically start uploading files when significant movement is detected. GPS is not used.";
